{"inkVersion":21,"root":[["\n","^Yes sir?","\n",{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[["#","^speaker: Ms. Tendwell","/#","ev","str","^Where were you night of the murder?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Have you noticed anything suspicious?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^What did you think of Admiral Hold?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^<i>Examine the suspect.</i>","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Leave","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Ms. Tendwell, I found some letters that you wrote...","/str",{"VAR?":"love_letters"},{"VAR?":"extort_Dorothy"},"!","&&","/ev",{"*":".^.c-5","flg":5},{"c-0":["\n","^Well sir, that evening I busied myself cleaning the Admiral's duelling pistols when I heard a commotion in the Admiral's study. There, I overheard the Admiral and Lady Hold in a rather heated conversation. Lady Hold left the Admiral's office quite distraught.","\n","^I escorted Lady Hold to her chambers and comforted her, after which I returned to my own quarters.","\n",{"->":"Night_Of_Murder"},{"#f":5}],"c-1":["\n","^Suspicious, sir? I'm not sure I understand.","\n",{"->":"Suspicious"},{"#f":5}],"c-2":["\n","^Admiral Hold was an excellent employer. He provided me with clean lodgings, a warm bed, and six shillings a week in pay. And he adored little Avery. I thought very highly of him.","\n",{"->":"Relationship"},{"#f":5}],"c-3":["\n",{"->":"Examination"},{"#f":5}],"c-4":["\n","done",{"#f":5}],"c-5":["\n","^I-","\n","^How could you possibly have- Oh heavens. Oh heavens!  Oh <i>heavens</i>!","\n","^Sir, this is not what you think it is! I know the content of those letters is terribly debaucherous. But I can explain, sir, truly!","\n","^Just- please sir, I beg you, don't tell Lady Hold. She's such a dignified lady. She would be so ashamed to discover her lady's maid speaking in such a lewd manner.","\n",{"->":"Lesbians_Revealed"},{"#f":5}]}],{"#f":1}],"Night_Of_Murder":[["ev","str","^How did you discover the body?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did you hear what Charles and Theodosia were arguing about?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Why were you cleaning the Admiral's duelling pistols?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Do you think Avery could have been involved in the Admiral's death somehow?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Let's talk about something else.","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^Well sir, I was alone in my quarters last night, when I suddenly heard young Master Avery screaming.","\n","^I was in such an awful rush to find the poor boy that- to my shame- I ran down the main staircase while still in my nightgown.","\n","^I'm afraid by the time I found him, poor Avery had already seen the Amdiral's-","\n","^By which I mean that the Admiral was- expired. Oh, even the thought of it- it's too horrible to bear!","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Lady Hold has often tells me she considers it is vulgar when servants make excessive use of their senses and faculties, so I thought it especially rude to listen.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Well, before he- expired- Admiral Hold requested that I prepare his duelling pistols for him.","\n","^He seemed to imply that he would have some use for them upon your arrival, though what use exactly, I couldn't say","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^<i>Sir!</i>","\n","^Young Master Avery is a <i>child</i>! Hardly even eight years of age! To imply that he could have had a hand in good Admiral Hold's- in his-","\n","^Well, it's simply unthinkable! And I am quite sure the noble profession of journalism would <i>never</i> engage in baseless speculation!","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n","^Very well.","\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Relationship":[["ev","str","^How long have you worked for the Hold family?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did the Admiral ever treat you poorly?","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^Well sir, I came to Wenchwatch Hall seven years ago, shortly after the birth of young Master Avery. They have been remarkably kind to me.  I only hope to repay their kindness.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Oh no sir, Admiral Hold was very respectful, a perfect gentleman. If anything, I have treated the Admiral poorly.","\n","^Why, only last week, I was four minutes late delivering his breakfast to him.","\n","^That was a dark day.","\n","^I only wish that his younger brother took after the Admiral in that regard. He can at times be a bit-","\n","^A bit- lustful, if you'll excuse my language.","\n",{"->":".^.^.^.Lustful"},{"#f":5}]}],{"Lustful":[["ev","str","^Has Maximillian made inappropriate advances towards you?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Wait, you mean the gay guy in the wig?!","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Let's move on.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^I'm afraid so. Only last week, he- he placed his <i>hand</i> upon my <i>shoulder</i>! I nearly fainted from the shock.","\n","^But please do keep that to yourself, sir. I know Lady Hold would be terrible disappointed to discover I was involved in such an obscenity with her brother-in-law.","\n",{"->":".^.^.^.^"},{"#f":5}],"c-1":["\n","^Sir Maximillian is a very happy chap, you are quite right. I was surprised too that a man of such esteem and grace could have such a- wandering hand.","\n","^But I must admit, he has garnered a reputation for being <i>fond</i> of the company of women.","\n",{"->":".^.^.^.^"},{"#f":5}],"c-2":["\n","^Yes sir.","\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"#f":1}],"Suspicious":[["ev","str","^Did anyone in the house hold a grudge against Charles?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did you notice anything unusual about the body?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Lady Hold doesn't seem very upset. Could she have something to do with the Admiral's death?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Let's talk about something else.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^Well, young master Avery was admittedly somewhat displeased that the Admiral confiscated his copy of the Iliad.","\n","^Barring that, I can't think of a single reason for anyone to dislike Charles.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Well, I did notice that the Admiral seemed to have something in his grasp.","\n","^Though I must admit, I didn't look very closely.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Lady Hold would <i>never</i> involve herself in such a horrid affair! Besides, she confined herself to her room for most of the night.","\n","^Poor Lady Hold. She would never dare admit it, but she was terribly upset over her argument with Charles. I could hear her weeping from my quarters.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Lesbians_Revealed":[["ev","str","^What's the big deal? It's just an ankle.","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^You trollop!","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Who is \"L\"?","/str",{"VAR?":"found_lavender_name"},"!","/ev",{"*":".^.c-2","flg":5},"ev","str","^So, you and Lavender are an item?","/str",{"VAR?":"found_lavender_name"},"/ev",{"*":".^.c-3","flg":5},{"c-0":["\n","^Thank you for being so kind, sir, but I know you must think, and you're quite right: I'm a harlot. A strumpet. I've turned the noble Wenchwatch Hall into a mere brothel!","\n","^But I swear to you, those letters were a momentary lapse in judgement, and L-","\n","^They were only ever intended for one particular person's private enjoyment. They were not intended for- public consumption.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^You are quite right sir. I've debased myself. You must think me some sort of harlot, or strumpet, or- brothel-keeper. I've disgraced the name of noble Wenchwatch Hall.","\n","^But I swear to you, those letters were a momentary lapse in judgement, and L-","\n","^They were only ever intended for one particular person's private enjoyment. They were not intended for- public consumption.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Someone who- I care about deeply. And who cares for me in return.","\n","^Someone without who life would be a little less colourful without.","\n","^Sir, I know I've acted disgracefully. And I know I have no reason to ask it- but-","\n","^Could you possibly look past this terrible indiscretion on my part?","\n",{"->":".^.^.^.Lesbians_Cont"},{"#f":5}],"c-3":["\n","^Lavender and I...","\n","^Yes. Lavender and I are together. I'm sure this must surprise you. It surprised me. For many reasons.","\n","^Lavender can be rude, abrasive. She has hardly a trace of decorum, and more often than not smells of horse.","\n","^But she is also kind. And gentle. And she loves me. For all my flaws and inadequacies. She loves me regardless. And I love her.","\n","^In all my years, never did I imagine that such a love such as Lavender's was even possible. But now that I have found her, I couldn't bear to be without it. Without her.","\n","^Sir, I know I have acted shamefully. I know you must think little of me. And I know I do not deserve it. But I would ask that you find some way to forget what you saw in those letters.","\n","^People may not understand what Lavender- what <i>we</i> are, and should Lady Hold- should our families find out about us-","\n","^I fear what the consequences of their discovery might be.","\n","^Could you possibly look past this terrible indiscretion on my part?","\n",{"->":".^.^.^.Lesbians_Cont"},{"#f":5}]}],{"Lesbians_Cont":[["ev","str","^Don't worry. I'll keep this to myself.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^This is too juicy to pass up! It's going on the front page!","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Okay. But it's gonna cost you.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^I need to think about this.","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^Thank you, sir. I can't possibly thank you enough.","\n",{"->":"Start"},{"#f":5}],"c-1":["\n","^Please, sir. I beg you. I know I've made mistakes, I know I may deserve it. But please. <i>Please.</i>","\n",{"->":"Start"},{"#f":5}],"c-2":["\n","^Cost, sir? I'm not sure I understand.","\n",{"->":".^.^.^.^.Extortion"},{"#f":5}],"c-3":["\n","^Sir, I beg you to forget you ever saw those letters. It was a momentary lapse in judgement, I swear. I will never be so reckless again!","\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Extortion":[["ev","str","^I'm blackmailing you, idiot! Haven't you ever met a journalist before?!","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I'll keep this quiet. For a fee.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Neiher do I. Ignore me.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"->":".^.^.^.^.Extortion_Final"},{"#f":5}],"c-1":["\n",{"->":".^.^.^.^.Extortion_Final"},{"#f":5}],"c-2":["\n","^I see. Thank you, sir.","\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Extortion_Final":[["^Oh. I see. I don't mean to anger you, sir, but I have precious little to give. One week's wages is all I have in savings.","\n","ev","str","^Pay up or let the world know. Your choice.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^I'm sorry, but I need the money. I have a family. My kids need to eat.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Never mind. Forget I said anything.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n",{"#f":5}],"c-1":["\n","^I see. Very well, sir. Here. Now please. Let us both forget this conversation ever happened.","\n","ev",true,"/ev",{"VAR=":"extort_Dorothy","re":true},{"->":"Start"},{"#f":5}],"c-2":["\n","^Thank you, sir. Thank you.","\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"#f":1}],"Examination":[["ev","str","^Examine her hands.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine her face.","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine her clothing.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Return to the conversation","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^<i> Her hands are clean and unmarked.  </i>","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^<i> Her face is clean, though her eyes are slightly red, as though she has been crying. </i>","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^<i> Her clothes are practical, modest, and well-kept. </i>","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"global decl":["ev",false,{"VAR=":"test_secret"},false,{"VAR=":"found_swapped_gloves"},true,{"VAR=":"found_lavender_name"},false,{"VAR=":"found_dorothy_name"},true,{"VAR=":"test_true"},false,{"VAR=":"test_false"},false,{"VAR=":"avery_confiscated_item"},true,{"VAR=":"love_letters"},false,{"VAR=":"Chair"},false,{"VAR=":"Brooch"},false,{"VAR=":"extort_Dorothy"},"/ev","end",null],"#f":1}],"listDefs":{}}