{"inkVersion":21,"root":[["\n",{"->":"Start"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"Start":[[["ev","visit",1,"MIN","/ev","ev","du",0,"==","/ev",{"->":".^.s0","c":true},"ev","du",1,"==","/ev",{"->":".^.s1","c":true},"nop",{"s0":["pop","^Should you intend to take my portraiture for your publication, I must insist you use take it from my left side. It is most uncouth for a lady of status to expose her right cheek to the great unwashed. ",{"->":".^.^.17"},null],"s1":["pop",{"->":".^.^.17"},null],"#f":5}],"^ ","#","^speaker: Theodosia Hold","/#","\n","ev","str","^Where were you night of the murder?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Have you noticed anything suspicious?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^How was your relationship with your husband?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^I know about your affair with Maximillian.","/str",{"VAR?":"test_secret"},"/ev",{"*":".^.c-3","flg":5},"ev","str","^Did you know your husband was planning to divorce you?","/str",{"VAR?":"test_secret"},"/ev",{"*":".^.c-4","flg":5},"ev","str","^Do you know Ms. Ditch and Ms. Treadwell are in a relationship?","/str",{"VAR?":"test_secret"},"/ev",{"*":".^.c-5","flg":5},"ev","str","^<i> Examine the suspect. </i>","/str","/ev",{"*":".^.c-6","flg":4},"ev","str","^Leave","/str","/ev",{"*":".^.c-7","flg":4},{"c-0":["\n","^I had retired to my chambers rather early to indulge in a most ladlylike fit of weeping.","\n","^You may confer with my maid to confirm this.","\n",{"->":"Night_Of_Murder"},{"#f":5}],"c-1":["\n",{"->":"Suspicions"},{"#f":5}],"c-2":["\n","^A most invasive question to ask a freshly made widow, though I shall allow it. I find the outrageous gall of you newspaper men quite charming.","\n",{"->":"Relationship"},{"#f":5}],"c-3":["\n","^Hm? What's this? I am quite sure I have no idea what you mean.","\n","done",{"#f":5}],"c-4":["\n","^Oh yes, I intuited as much. A well-bred woman has an instinct for her husband's flights of fancy.","\n","^I am quite sure he would have abandoned the idea entirely, had he not perished.","\n",{"->":"Divorce"},{"#f":5}],"c-5":["\n","^The maid and the stable hand? Ensnared in a Sapphic scandal? How curious! How queer! How modern!","\n","^Really, if the lower orders cannot set us a good example, what on earth is the use of them?","\n",{"->":"Start"},{"#f":5}],"c-6":["\n",{"->":"Examination"},{"#f":5}],"c-7":["\n","done",{"#f":5}]}],{"#f":1}],"Relationship":[["ev","str","^Was Charles a good husband?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did you love Charles?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^You don't seem particularly sad that Charles is dead.","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Tell me about how you two met.","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Let's talk about something else","/str","/ev",{"*":".^.c-4","flg":4},{"c-0":["\n","^Charles performed his marital duties adequately. He provided a modest dwelling-place, a small allowance to keep me adorned in the most recent fashions, and rarely spoke. A most desirable quality in a husband. He also begot a male heir. A most sensible decision on his part. Eldest daughters are somewhat vulgar, wouldn't you agree?","\n",{"->":".^.^.^.Eldest_Daughter"},{"#f":5}],"c-1":["\n","^Certainly <i>not</i>!","\n","^The exchange of love tokens and flowery letters is acceptable during courtship. Perhaps even for the first six weeks of a marriage. However, love between spouses of any greater duration is exceptionally garish.","\n","^For a wife of my tenure to express affection, would risk being mistaken for a prostitute, or a mistress of particularly poor breeding.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Do you expect keening and caterwauling of me, sir? Do you mistake me some sort of Irishman?","\n","^A widow must be demure in the face of death. It is one's duty to maintain the dignity of the family name, as it was Charles' duty to provide for our family. He did the latter relatively adequately in life and continues to do so in the face of death. I must do the same.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Ah, a wonderful day. My dear mother informed me that I was to be married to the Admiral Hold, and that I would be permitted five minutes of polite conversation with him that evening.","\n","^It was quite perfect. Exactly as I had imagined it as a young girl.","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n",{"->":"Start"},{"#f":5}]}],{"Eldest_Daughter":[["ev","str","^My eldest child is a girl.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^That's horrendous. I love my daughter with all my heart!","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Let's move on.","/str","/ev",{"*":".^.c-2","flg":4},{"c-0":["\n","^My deepest sympathies.","\n",{"->":".^.^.^.^"},{"#f":5}],"c-1":["\n","^Expressing parental affection so blatantly? How quaint! The eccentricities of the common rabble never cease to amaze.","\n",{"->":".^.^.^.^"},{"#f":5}],"c-2":["\n",{"->":".^.^.^.^"},{"#f":5}]}],{"#f":1}],"#f":1}],"Night_Of_Murder":[["ev","str","^Why were you crying?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^What were you and Charles arguing about?","/str",{"VAR?":"argument"},"/ev",{"*":".^.c-1","flg":5},"ev","str","^Why should I confer with your maid?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^How did you discover the body?","/str","/ev",{"*":".^.c-3","flg":4},"ev","str","^Did you hear anything that night?","/str","/ev",{"*":".^.c-4","flg":4},"ev","str","^Let's talk about something else.","/str","/ev",{"*":".^.c-5","flg":4},{"c-0":["\n","^I was engaged in vigorous conversation with my husband Charles. This was before he died, you see.","\n","^I do believe the conversation overwhelmed my feminine sensibilities and drove me to tears. A foolish decision on my part to engage in such activity. It is most harmful to a lady's health to engage in any activity which can be considered <i>vigorous</i>.","\n","ev",true,"/ev",{"VAR=":"argument","re":true},{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^Oh, matters of a marital nature. Such was the banality of our conversation that I was driven to tears. Entirely too dull for publication, I assure you.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Ms. Tendwell was present as I was leaving Charles'  study. One must admit, she performed her duties most admirably. She escorted me to my chambers and went to her own quarters upon my request. Crying in front of one's staff should be avoided at all cost. It is terribly European.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n","^Ms. Tendwell interrupted my private weeping to inform me that Charles had been slain. It is terribly inappropriate to interrupt one's private weeping. However, given the occassion, I believe Ms. Tendwell acted appropriately.","\n",{"->":".^.^.^"},{"#f":5}],"c-4":["\n","^I do believe I heard some unusual sounds emanating from Ms. Tendwell's room, as I have heard on several nights past. I generally disapprove of serving girls creating noise. However, Ms. Tendwell's performance is quite satisfactory, so I have elected to overlook this indiscretion.","\n",{"->":".^.^.^"},{"#f":5}],"c-5":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Suspicions":[["ev","str","^Has anyone in the house been acting strange?","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Did you notice anything unusual about the body?","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Did your husband have any enemies?","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Let's talk about something else","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^I have always found one Ms. Lavender Ditch to be a most unusual character. Her manner is most sullen, and one cannot help but question the morals of a woman who elects to spend her days mucking about in a stables.","\n","^I requested Charles release her from her duties several times. Alas, men of Charles' calibre are often dodddering when expedition is required and far too quick to finish when strenuous labour would be of benefit.","\n","^One does hope you will make note of these pithy observations of mine in your publication.","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^One cannot help but notice the dramatic position in which my dear husband chose to die. A true testament to his character. Only one of immaculate breeding such as Charles would succumb to rigor morits in such a statuesque pose.","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^Charles was fond of all peoples and creatures under the sun.","\n","^Barring the Irish. He loathed the Irish.","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Examination":[["ev","str","^Examine her hands.","/str","/ev",{"*":".^.c-0","flg":4},"ev","str","^Examine her face","/str","/ev",{"*":".^.c-1","flg":4},"ev","str","^Examine her clothing","/str","/ev",{"*":".^.c-2","flg":4},"ev","str","^Return to the conversation","/str","/ev",{"*":".^.c-3","flg":4},{"c-0":["\n","^<i> Her gloves are a pristine white. You notice that they are monogrammed. They bear the initials \"M.H\".</i>","\n",{"->":".^.^.^"},{"#f":5}],"c-1":["\n","^<i> Her face is well painted, but not garishly so. Her lipstick is a dull rouge.</i>","\n",{"->":".^.^.^"},{"#f":5}],"c-2":["\n","^<i> Her attire is undeniably stylish. She's the best dressed widow you've ever seen. </i>","\n",{"->":".^.^.^"},{"#f":5}],"c-3":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Divorce":[["ev","str","^But you were sleeping with his brother!","/str",{"VAR?":"test_secret"},"/ev",{"*":".^.c-0","flg":5},"ev","str","^Let's talk about something else","/str","/ev",{"*":".^.c-1","flg":4},{"c-0":["\n","^And we can be most certain that Charles had a litany of his own lovers and companions, as is the case with most men of his rank.","\n","^It is entirely appropriate for a lady in such a situation to find herself a discrete companion of her own.","\n","^Charles understood this, one is quite sure. Love affairs and adultery are concerns for the common man. The aristocracy have greater troubles to consider.","\n","^He would have come to this realisation himself. I am quite sure he would.","\n",{"->":"Start"},{"#f":5}],"c-1":["\n",{"->":"Start"},{"#f":5}]}],{"#f":1}],"Affair":["^TTBC","\n","done",{"#f":1}],"global decl":["ev",false,{"VAR=":"test_secret"},false,{"VAR=":"found_swapped_gloves"},true,{"VAR=":"found_lavender_name"},false,{"VAR=":"found_dorothy_name"},true,{"VAR=":"test_true"},false,{"VAR=":"test_false"},false,{"VAR=":"avery_confiscated_item"},true,{"VAR=":"love_letters"},false,{"VAR=":"Chair"},false,{"VAR=":"Brooch"},false,{"VAR=":"extort_Dorothy"},false,{"VAR=":"argument"},"/ev","end",null],"#f":1}],"listDefs":{}}